# **피벗테이블**

pd.pivot_table(대상으로 할 데이터프레임, values = 어떠한 것을 기준으로 만들 것인지, index = [왼쪽], columns = [어떤 것으로 정리하겠다]

In [ ]:
import pandas as pd
import numpy as np

\- 문제 : 다음 데이터 프레임은 A 서비스의 월별 탈퇴 회원수를 가입 월별로 분류해 놓은 것이다. 이 데이터 프레임을 이용하여 피벗 테이블을 만드시오.

In [ ]:
df = pd.DataFrame({'가입월' : [1, 1, 1, 2, 2, 3], '탈퇴월' : [1, 2, 3, 2, 3, 3], '탈퇴회원수' : [101, 52, 30, 120, 60, 130]})

In [ ]:
df

   가입월  탈퇴월  탈퇴회원수
0    1    1    101
1    1    2     52
2    1    3     30
3    2    2    120
4    2    3     60
5    3    3    130

In [ ]:
pivot = pd.pivot_table(df, values = '탈퇴회원수' , index = ['가입월'], columns = ['탈퇴월'])

In [ ]:
type(pivot)

pandas.core.frame.DataFrame

In [ ]:
pivot

탈퇴월      1      2      3
가입월
1    101.0   52.0   30.0
2      NaN  120.0   60.0
3      NaN    NaN  130.0

In [ ]:
# NaN 값을 0으로 바꾸기
pd.pivot_table(df, values = '탈퇴회원수' , index = ['가입월'], columns = ['탈퇴월'], fill_value = 0 )

탈퇴월    1    2    3
가입월
1    101   52   30
2      0  120   60
3      0    0  130

\-  문제 : 다음 데이터 프레임은 어느 과일 매장의 판매내역이다. 각 상품 항목 별, 크기 별로 판매 개수와 판매 금액의 합을 구하시오.

In [ ]:
import random

In [ ]:
# 초기값과 마지막 값을 지정해줄 수 있는 함수 : randint

random.randint(1,3)

2

In [ ]:
a = []      # 리스트 생성
b = []

for i in range(100):
    a.append(random.randint(1,3))
    b.append(random.randint(1,3))

In [ ]:
df = pd.DataFrame({'품목' : a, '크기' : b})

In [ ]:
df

    품목  크기
0    2   2
1    2   3
2    2   2
3    1   3
4    1   1
..  ..  ..
95   1   1
96   1   2
97   1   3
98   2   2
99   2   1

[100 rows x 2 columns]

In [ ]:
df['금액'] = df['품목'] * df['크기'] * 500
df['수수료'] = df['금액'] * 0.1

In [ ]:
df

    품목  크기    금액    수수료
0    2   2  2000  200.0
1    2   3  3000  300.0
2    2   2  2000  200.0
3    1   3  1500  150.0
4    1   1   500   50.0
..  ..  ..   ...    ...
95   1   1   500   50.0
96   1   2  1000  100.0
97   1   3  1500  150.0
98   2   2  2000  200.0
99   2   1  1000  100.0

[100 rows x 4 columns]

In [ ]:
fruit_name = {1 : '토마토', 2 : '바나나', 3 : '사과'}
fruit_size = {1 : '소', 2 : '중', 3 : '대'}

df['품목'] = df['품목'].map(fruit_name)
df['크기'] = df['크기'].map(fruit_size)

In [ ]:
df

     품목 크기    금액    수수료
0   바나나  중  2000  200.0
1   바나나  대  3000  300.0
2   바나나  중  2000  200.0
3   토마토  대  1500  150.0
4   토마토  소   500   50.0
..  ... ..   ...    ...
95  토마토  소   500   50.0
96  토마토  중  1000  100.0
97  토마토  대  1500  150.0
98  바나나  중  2000  200.0
99  바나나  소  1000  100.0

[100 rows x 4 columns]

In [ ]:
pd.pivot_table(df, values = '금액', index = ['품목'], columns = ['크기'], aggfunc = ( 'count', 'sum'))

    count            sum
크기      대   소   중      대      소      중
품목
바나나    10  10  12  30000  10000  24000
사과      9  16  10  40500  24000  30000
토마토    17   7   9  25500   3500   9000

\-  문제 : 다음 데이터 프레임은. 어느 과일 매장의 판매내역이다. 각 상품 항목 별, 크기 별로. 판매 개수와 판매 금액 / 수수료의 합을 구하시오.

In [ ]:
df

     품목 크기    금액    수수료
0   토마토  중  1000  100.0
1    사과  소  1500  150.0
2   바나나  대  3000  300.0
3    사과  소  1500  150.0
4   토마토  대  1500  150.0
..  ... ..   ...    ...
95  토마토  중  1000  100.0
96   사과  소  1500  150.0
97  토마토  중  1000  100.0
98  바나나  대  3000  300.0
99  토마토  소   500   50.0

[100 rows x 4 columns]

In [ ]:
pd.pivot_table(df, index = ['품목'], columns = ['크기'], aggfunc = {'금액' : ['count', 'sum'], '수수료' : 'sum'})

       금액                                  수수료
    count            sum                   sum
크기      대   소   중      대      소      중       대       소       중
품목
바나나    10  10  12  30000  10000  24000  3000.0  1000.0  2400.0
사과      9  16  10  40500  24000  30000  4050.0  2400.0  3000.0
토마토    17   7   9  25500   3500   9000  2550.0   350.0   900.0